[ "r1", "The uniform dark brown of state facilities everywhere covers the interior joists, supports, and paneling of this dim picnic enclosure. Ripped screens in paneless windows permit entry to both the elements and a large portion of the insect population. A few rough wooden picnic tables sit upon the cracked concrete floor, and flapping screened doorways allow exit to both the north and south of the building."]

[ "r2", "You stand upon a flat expanse of well-kempt grass that stretches between the State Park facility to the south and the expanse of Lake Dunmore to the north. Seagulls wheel and cry above you, occasionally alighting on the turf to seek salvage and scraps. The the east sprouts a cluster of picnic tables, while the Green continues to the west." ]

[ "r3", "The uniform dark brow of state facilities everywhere covers the interior joists, supports, and paneling of this dim picnic enclosure. Ripped screens in paneless windows permit entry to both the elements and a large portion of the insect population. A few rough wooden picnic tables sit upon the cracked concrete floor, and flapping screened doorways allow exit to both the north and south of the building."]

[ "r4", "The well-kept expanse of grass beneath your feet separates a low State Park building to the south from the shore of Lake Dunmore to your north. The wide expanse of green continues to the east; west of here, a dirt path slopes down to the water to ease the launching of boats onto Lake Dunmore."]

[ "r5", "A dozen weathered plank tables are strewn about the healthy grass here, providing surface for parties of parkgoers to lunch. A wide grassy swath stretches west of here; to the south you see some towering playground equipment."]

[ "r6", "A narrow strip of well-manicured grass clings to the south edge of the low, broad State Park facility building here. The other three sides of this small yard are bordered by a split-rail fence. You can enter the facility through tattered screen doors to the northeast or the northwest, head east toward some towering playground equipment, or head south into the parking area." ]

[ "r7", "A single mass of towring playground equipment dominates a bark-paved square which has been set off from the grass around it by what appear to be railroad ties. A few smaller pieces of equipment dot the area surrounding the main mass, like children or client kings. To the north you see some picnic tables scattered about, and a narrow strip of grass lies to the west. To the southwest is a rather extensive parking area."]

[ "r8", "A gravel-and-dirt path cuts through the well-kept green grass here all the way to the verge of the lake. The path's shallow slope facilitates the transport and launch of small boats to and onto the surface of Lake Dunmore. An expanse of green grass continues east from here along the shore of the lake, but a cyclone fence prevents you from entering the private property to your west. A parking area extends south of here."]

[ "r9", "The northernmost row of spaces, those closest to the lake and the recreational facility, are paved and striped, but several more tiers of tree-shaded, dirt-and-grass parking stretch southward; evidently Branbury State Park can be a popular destination when the weather is favorable. North of here a low, brown-painted building separates the parking lot from the lake; to the northwest there appears to be an area for launch boats, and you can see a large jumble of playground equipment rising to the northeast." ]

[ "r10", "The walls and floor of this dim underground chamber are rough in some places, but in others have been shaped by the pouring of concrete. A rusty iron grating controlls progress along a tunnel to the south, and  an iron-rimmed hole in the ceiling seems to allow access to the surface."]
